package digispark.tech.ganapatiaarti;

import android.content.Intent;
import android.os.Bundle;
import android.util.DisplayMetrics;
import android.view.MenuItem;
import android.view.View;
import android.widget.Button;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;

public class written_hindi_detail_aarti extends AppCompatActivity {
    int intValue;
    int a;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_written_eng_detail_aarti);
        Intent intent = getIntent();


        DisplayMetrics metrics = new DisplayMetrics();
        getWindowManager().getDefaultDisplay().getMetrics(metrics);
        int height = metrics.heightPixels;
        int width = metrics.widthPixels;
        Button b1,b2;
        b1 =(Button)(findViewById(R.id.b1));
        b2 =(Button)(findViewById(R.id.b2));
        b1.setWidth((width/2)-20);
        b2.setWidth((width/2)-20);


    intValue = intent.getIntExtra("songindex", 0);
        TextView t1,t2;
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        t1 =(TextView)(findViewById(R.id.txt));
        t2 = (TextView)(findViewById(R.id.t1));
        if(intValue ==0)
        {
            t2.setText("सुखकर्ता दुखहर्ता");
            t1.setText("सुखकर्ता दुखहर्ता वार्ता विघ्नाची |\n" +
                    "नुरवी पूर्वी प्रेम कृपा जयाची |\n" +
                    "सर्वांगी सुंदर उटी शेंदुराची |\n" +
                    "कंठी झरके माल मुक्ताफळाची || १ ||\n" +
                    "\n" +
                    "जय देव जय देव जय मंगलमूर्ती |\n" +
                    "दर्शनमात्रे मनकामना पुरती ||\n" +
                    "रत्नखचित फरा तूज गौरीकुमरा |\n" +
                    "चंदनाची उटी कुंकुमकेशरा |\n" +
                    "हिरे जडित मुकुट शोभतो बरा |\n" +
                    "रुणझुणती नुपुरे चरणी घागरिया || 2 ||\n" +
                    "\n" +
                    "लंबोदर पितांबर फनी वरवंदना |\n" +
                    "सरळ सोंड वक्रतुंड त्रिनयना |\n" +
                    "दास रामाचा वाट पाहे सदना |\n" +
                    "संकटी पावावे निर्वाणी रक्षावे सुरवंदना |\n" +
                    "जय देव जय देव जय मंगलमूर्ती |\n" +
                    "दर्शनमात्रे मनकामना पुरती || ३ ||");
        }
        if(intValue ==2)
        {
            t2.setText("लवथवती विक्राळा");
            t1.setText("लवथवती विक्राळा ब्रह्माण्डी माळा।\n" +
                    "वीषे कण्ठ काळा त्रिनेत्री ज्वाळा।\n" +
                    "लावण्य सुन्दर मस्तकी बाळा।\n" +
                    "तेथुनिया जळ निर्मळ वाहे झुळझुळा॥\n" +
                    "\n" +
                    "जय देव जय देव जय श्रीशंकरा।\n" +
                    "आरती ओवाळू तुज कर्पुरगौरा॥\n" +
                    "\n" +
                    "कर्पुर्गौरा भोळा नयनी विशाळा।\n" +
                    "अर्धांगी पार्वती सुमनांच्या माळा।\n" +
                    "विभुतीचे उधळण शितिकण्ठ नीळा।\n" +
                    "ऐसा शंकर शोभे उमावेल्हाळा॥\n" +
                    "\n" +
                    "जय देव जय देव जय श्रीशंकरा।\n" +
                    "आरती ओवाळू तुज कर्पुरगौरा॥\n" +
                    "\n" +
                    "देवी दैत्यी सागरमन्थन पै केलें।\n" +
                    "त्यामाजी अवचित हळाहळ जें उठिले।\n" +
                    "ते त्वां असुरपणे प्राशन केलें।\n" +
                    "नीलकण्ठ नाम प्रसिद्ध झालें॥\n" +
                    "\n" +
                    "जय देव जय देव जय श्रीशंकरा।\n" +
                    "आरती ओवाळू तुज कर्पुरगौरा॥\n" +
                    "\n" +
                    "व्याघ्राम्बर फणिवरधर सुन्दर मदनारी।\n" +
                    "पंचानन मनमोहन मुनिजन सुखकारी।\n" +
                    "शतकोटीचें बीज वाचे उच्चारी।\n" +
                    "रघुकुळटिळक रामदासा अन्तरी॥\n" +
                    "\n" +
                    "जय देव जय देव जय श्रीशंकरा।\n" +
                    "आरती ओवाळू तुज कर्पुरगौरा॥");
        }
        if(intValue ==1)
        {
            t2.setText("शेंदूर लाल चढायो");
            t1.setText("शेंदूर लाल चढायो अच्छा गजमुखको ||\n" +
                    "दोंदिल लाल बिराजे सूत गौरीहरको ||\n" +
                    "हाथ लिए गुड-लड्डू साईं सुरवरको ||\n" +
                    "महिमा कहे ना जाय लागत हूँ पदको || 1 ||\n" +
                    "\n" +
                    "जय जय श्री गणराज विध्यासुखदाता || धन्य तुम्हारा दर्शन मेरा मन रमता ||\n" +
                    "\n" +
                    "अष्टो सिद्धि दासी संकटको बैरी ||\n" +
                    "विघनाविनाशन मंगल मूरत अधिकारी ||\n" +
                    "कोटि सूरजप्रकाश ऐसी छबि तेरी ||\n" +
                    "गंड-स्थल मदमस्तक झूले शाशिहारी || 2 ||\n" +
                    "\n" +
                    "जय जय श्री गणराज विध्यासुखदाता || धन्य तुम्हारा दर्शन मेरा मन रमता ||\n" +
                    "\n" +
                    "भावभगत से कोई शरणागत आवे ||\n" +
                    "संतति सम्पति सभी भरपूर पावे ||\n" +
                    "ऐसे तुम महाराज मोको अति भावे ||\n" +
                    "गोसावीनंदन निशिदिन गुण गावे || 3 ||\n" +
                    "\n" +
                    "जय जय श्री गणराज विध्यासुखदाता || धन्य तुम्हारा दर्शन मेरा मन रमता ||");
        }
        if(intValue ==5)
        {
            t2.setText("येई हो विठ्ठले माझे माऊली ये");
            t1.setText("\n" +
                    "येई हो विठ्ठले माझे माऊली ये ॥\n" +
                    "निढळावरी कर ठेऊनी वाट मी पाहे ॥ धृ. ॥\n" +
                    "आलिया गेलीया हातीं धाडी निरोप ॥\n" +
                    "पंढरपुरी आहे माझा मायबाप ॥ १ ॥\n\n" +
                    "येई हो विठ्ठले माझे माऊली ये ॥\n" +
                    "पिंवळा पीतांबर कैसा गगनी झळकला ॥\n" +
                    "गरुडावरी बैसून माझा कैवारी आला ॥ २ ॥\n\n" +
                    "येई हो विठ्ठले माझे माऊली ये ॥\n" +
                    "विठोबाचे राज आम्हां नित्य दिपवाळी ॥\n" +
                    "विष्णुदास नामा जीवेंभावे ओंवाळी ॥ ३ ॥\n\n" +
                    "येई हो विठ्ठले माझे माऊली ये ॥" +

                    "\n" +
                    "विठोबाचे राजमं नित्य दीपावली\n" +
                    "विष्णुदास नाराज भावे ओवाली\n" +
                    "आई ओह विठ्ठले म्हजो मौलये ॥");
        }
        if(intValue ==3)
        {
            t2.setText("दुर्गे दुर्घट भारी");
            t1.setText("दुर्गे दुर्घट भारी तुजवीण संसारी \n" +
                    "अनाथ नाथे अंबे करुणा विस्तारी \n" +
                    "वारी वारी जन्म मरण तेवारी \n" +
                    "हारी पडलो आता संकट नेवारी\n" +
                    "जय देवी जय देवी जय महिषासुर मर्दिनी \n" +
                    "सुरवर ईश्वर वरदे तारक संजीवनी \n" +
                    "जय देवी जय देवी\n" +
                    "\n" +
                    "\n" +
                    "तुजवीण  भुवनी पाहत तुज ऐसे नाही \n" +
                    "चारी श्रमले परंतु न बोलवे काही \n" +
                    "साही विवाद करिता पडिलो प्रवाही \n" +
                    "ते तू भक्ता लागे ते तू दस लागे पावस लवलाही \n" +
                    "जय देवी जय देवी जय महिषासुर मर्दिनी \n" +
                    "सुरवर ईश्वर वरदे तारक संजीवनी \n" +
                    "जय देवी जय देवी\n" +
                    "\n" +
                    "\n" +
                    "प्रसन्न वदने प्रसन्न होशी निजदासा \n" +
                    "क्लेशांपासून तोडी होई भोपाषा \n" +
                    "आंबे तुजवाचून कोण पुरवी आशा \n" +
                    "नरहर तल्लीन झाला पद पंकज लेशा\n" +
                    "जय देवी जय देवी जय महिषासुर मर्दिनी \n" +
                    "सुरवर ईश्वर वरदे तारक संजीवनी \n" +
                    "जय देवी जय देवी");
        }
        if(intValue ==7)
        {
            t2.setText("ओम जय जगदीश हरे");
            t1.setText("ओम जय जगदीश हरे, स्वामी जय जगदीश हरे " +
                    "भक्त जनों के संकट, दास जनों के संकट " +
                    "क्षण में दूर करें, ओम जय जगदीश हरे " +
                    "जो ध्यावे फल पावे, दुख बिन से मन का " +
                    "" +
                    "स्वामी दुख बिन से मन का, सुख संपति घर " +
                    "आवे " +
                    "स्वामी, सुख संपति घर आवे, कष्ट मिटे तन का " +
                    "ओम जय जगदीश हरे\n\n" +
                    "माता पिता तुम मेरे, शरण पाऊँ मैं किसकी " +
                    "स्वामी शरण पाऊँ मैं किसकी, तुम बिन और ना " +
                    "दूजा " +
                    "प्रभु बिन और ना दूजा, आस करूँ मैं जिसकी " +
                    "ओम जय जगदीश हरे\n\n" +
                    "तुम पूरण परमात्मा, तुम अंतर्यामी " +
                    "स्वामी तुम अंतर्यामी, पर ब्रह्म परमेश्वर " +
                    "स्वामी, पर ब्रह्म परमेश्वर, तुम सबके स्वामी " +
                    "ओम जय जगदीश हरे\n\n" +
                    "तुम करुणा के सागर, तुम पालन करता " +
                    "स्वामी तुम पालन करता, मैं मूरख खल कामी " +
                    "मैं सेवक तुम स्वामी, कृपा करो भरता " +
                    "ओम जय जगदीश हरे\n\n" +
                    "तुम हो एक अगोचर, सब के प्राण पति " +
                    "स्वामी सब के प्राण पति, किस विधि मिलूं " +
                    "गोसाईं " +
                    "किस विधि मिलूं दयालु, तुम को मैं कुमति " +
                    "ओम जय जगदीश हरे\n\n" +
                    "दीन बंधु दुख हरता, ठाकुर तुम मेरे " +
                    "स्वामी ठाकुर तुम मेरे, अपने हाथ उठाओ " +
                    "अपनी शरन लगाओ, द्वार पड़ा हूं तेरे " +
                    "ओम जय जगदीश हरे\n\n" +
                    "विषय विकार मिटाओ, पाप हरो देवा " +
                    "स्वामी पाप हरो देवा, श्रद्धा भक्ति बढ़ाओ " +
                    "स्वामी, श्रद्धा भक्ति बढ़ाओ, संतों की सेवा \n\n" +
                    "" +
                    "ओम जय जगदीश हरे " +
                    "ओम जय जगदीश हरे, स्वामी जय जगदीश हरे " +
                    "भक्त जनों के संकट, दास जनों के संकट " +
                    "क्षण में दूर करें, ओम जय जगदीश हरे ||");
        }
        if(intValue ==6)
        {
            t2.setText("जय गणेश जय गणेश देवा");
            t1.setText("जय गणेश जय गणेश जय गणेश देवा। " +
                    "माता जाकी पार्वती पिता महादेवा॥ " +
                    "एकदन्त दयावन्त चारभुजाधारी " +
                    "माथे सिंदूर सोहे मूसे की सवारी ।। जय गणेश" +
                    "देवा\n\n" +
                    "पान चढ़े फूल चढ़े और चढ़े मेवा " +
                    "लॅडडुअन का भोग लगे सन्त करें सेवा॥ जय " +
                    "गणेश देवा " +
                    "अन्धन को आँख देत, कोढ़िन को काया। " +
                    "बाँझन को पुत्र देत, निर्धन को माया ।। जय गणेश" +
                    "देवा\n\n" +
                    "‘सूर’ श्याम शरण आए सफल कीजे सेवा " +
                    "माता जाकी पार्वती पिता महादेवा॥\n\n" +
                    "दीनन की लाज राखो, शम्भु सुतवारी " +
                    "कामना को पूर्ण करो, जग बलिहारी॥\n\n"+
                    "जय गणेश जय गणेश जय गणेश देवा।" +
                    "माता जाकी पार्वती पिता महादेवा॥");
        }

        if(intValue ==4)
        {
            t2.setText("युगें अठ्ठावीस");
            t1.setText("युगें अठ्ठावीस विटेवरी उभा।\n" +
                    "वामांगी रखुमाई दिसे दिव्य शोभा।\n" +
                    "पुण्डलिकाचे भेटी परब्रह्म आलें गा।\n" +
                    "चरणी वाहे भीमा उद्धरी जगा॥\n" +
                    "\n" +
                    "जय देव जय देव जय पाण्डुरंगा।\n" +
                    "रखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥\n" +
                    "\n" +
                    "तुळसीमाळा गळां कर ठेवुनि कटीं।\n" +
                    "कांसे पीताम्बर कस्तुरि लल्लाटी।\n" +
                    "देव सुरवर नित्य येती भेटी।\n" +
                    "गरुड हनुमन्त पुढे उभे राहती॥\n" +
                    "\n" +
                    "जय देव जय देव जय पाण्डुरंगा।\n" +
                    "रखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥\n" +
                    "\n" +
                    "धन्य वेणुनाद अनुक्षेत्रपाळा।\n" +
                    "सुवर्णाची कमळे वनमाळा गळां।\n" +
                    "राही रखुमाबाई राणीया सकळा।\n" +
                    "ओवाळिती राजा विठोबा सांवळा॥\n" +
                    "\n" +
                    "जय देव जय देव जय पाण्डुरंगा।\n" +
                    "रखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥\n" +
                    "\n" +
                    "ओवाळूं आरत्या कुर्वण्ड्या येती।\n" +
                    "चन्द्रभागेमाजी सोडुनियां देती।\n" +
                    "दिंड्या पताका वैष्णव नाचती।\n" +
                    "पंढरीचा महिमा वर्णावा किती॥\n" +
                    "\n" +
                    "जय देव जय देव जय पाण्डुरंगा।\n" +
                    "रखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥\n" +
                    "\n" +
                    "आषाढी कार्तिकी भक्तजन येती।\n" +
                    "चन्द्रभागेमाजी स्नाने जे करिती।\n" +
                    "दर्शनहेळामात्रें तयां होय मुक्ती।\n" +
                    "केशवासी नामदेव भावे ओंवाळिती॥\n" +
                    "\n" +
                    "जय देव जय देव जय पाण्डुरंगा।\n" +
                    "रखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥");
        }
        if(intValue ==8)
        {
            t2.setText("श्रीज्ञानदेवाची आरती ज्ञानराजा");
            t1.setText("आरती ज्ञानराजा ॥" +
                    "महाकैवल्यतेजा ॥" +
                    "सेविती साधुसंत ॥" +
                    "मनु वेधला माझा ॥ ध्रु० ॥\n\n" +
                    "लोपलें ज्ञान जगीं ॥" +
                    "त नेणती कोणी ॥" +
                    "अवतार पांडुरंग ॥" +
                    "नाम ठेविलें ज्ञानी ॥ आरती ॥ १ ॥\n\n" +
                    "कनकांचे ताट करीं ॥" +
                    "उभ्या गोपिका नारी ॥" +
                    "नारद तुंबरु हो ॥" +
                    "साम गायन करी ॥ आरती० ॥ २ ॥\n\n" +
                    "प्रगट गुह्य बोले ॥" +
                    "विश्व ब्रह्मची केलें ॥" +
                    "रामा जनार्दनीं ॥" +
                    "पायीं ठकचि ठेलें ॥ आरती० ॥ ३ ॥");
        }
        if(intValue ==9)
        {
            t2.setText("घालीन लोटांगण");
            t1.setText("घालीन लोटांगण" +
                    "घालीन लोटांगण, वंदीन चरण ।" +
                    "डोळ्यांनी पाहीन रुप तुझें ।" +
                    "प्रेमें आलिंगन, आनंदे पूजिन ।" +
                    "भावें ओवाळीन म्हणे नामा ।।१।।\n\n" +
                    "त्वमेव माता च पिता त्वमेव।" +
                    "त्वमेव बंधुक्ष्च सखा त्वमेव ।" +
                    "त्वमेव विध्या द्रविणं त्वमेव ।" +
                    "त्वमेव सर्वं मम देवदेव।।२।।\n\n" +
                    "कायेन वाचा मनसेंद्रीयेव्रा, बुद्धयात्मना वा प्रकृतिस्वभावात ।" +
                    "करोमि यध्य्त सकलं परस्मे, नारायणायेति समर्पयामि ।।३।।\n\n" +
                    "अच्युतं केशवं रामनारायणं कृष्णदामोदरं वासुदेवं हरिम।" +
                    "श्रीधरं माधवं गोपिकावल्लभं, जानकीनायकं रामचंद्र भजे ।।४।।\n\n" +
                    "हरे राम हर राम, राम राम हरे हरे ।" +
                    "हरे कृष्ण हरे कृष्ण, कृष्ण कृष्ण हरे हरे ।");
        }
        if(intValue ==11)
        {
            t2.setText("जय अम्बे गौरी मैया जय श्यामा गौरी");
            t1.setText("जय अम्बे गौरी, मैया जय श्यामा गौरी,\n" +
                    "तुमको निशदिन ध्यावत, हरि ब्रह्मा शिवरी।\n" +
                    "\n" +
                    "मांग सिंदूर विराजत, टीको मृगमद को,\n" +
                    "उज्ज्वल से दोउ नैना, चंद्रवदन नीको॥\n" +
                    "\n" +
                    "कनक समान कलेवर, रक्ताम्बर राजै,\n" +
                    "रक्तपुष्प गल माला, कंठन पर साजै॥\n" +
                    "\n" +
                    "केहरि वाहन राजत, खड्ग खप्पर धारी,\n" +
                    "सुर-नर-मुनिजन सेवत, तिनके दुखहारी॥\n" +
                    "\n" +
                    "कानन कुण्डल शोभित, नासाग्रे मोती,\n" +
                    "कोटिक चंद्र दिवाकर, सम राजत ज्योती॥\n" +
                    "\n" +
                    "शुंभ-निशुंभ बिदारे, महिषासुर घाती,\n" +
                    "धूम्र विलोचन नैना, निशदिन मदमाती॥\n" +
                    "\n" +
                    "चण्ड-मुण्ड संहारे, शोणित बीज हरे,\n" +
                    "मधु-कैटभ दोउ मारे, सुर भयहीन करे॥\n" +
                    "\n" +
                    "ब्रह्माणी, रूद्राणी, तुम कमला रानी,\n" +
                    "आगम निगम बखानी, तुम शिव पटरानी॥\n" +
                    "\n" +
                    "चौंसठ योगिनी मंगल गावत, नृत्य करत भैरों,\n" +
                    "बाजत ताल मृदंगा, अरू बाजत डमरू॥\n" +
                    "\n" +
                    "तुम ही जग की माता, तुम ही हो भरता,\n" +
                    "भक्तन की दुख हरता, सुख संपति करता॥\n" +
                    "\n" +
                    "भुजा चार अति शोभित, खडग खप्पर धारी,\n" +
                    "मनवांछित फल पावत, सेवत नर नारी॥\n" +
                    "\n" +
                    "कंचन थाल विराजत, अगर कपूर बाती,\n" +
                    "श्रीमालकेतु में राजत, कोटि रतन ज्योती॥\n" +
                    "\n" +
                    "श्री अंबेजी की आरति, जो कोइ नर गावे,\n" +
                    "कहत शिवानंद स्वामी, सुख-संपति पावे॥");
        }
        if(intValue ==10)
        {
            t2.setText("श्री दत्त आरती");
            t1.setText("त्रिगुणात्मक त्रैमूर्ती दत्त हा जाणा\n" +
                    "त्रिगुणी अवतार त्रैलोक्य राणा\n" +
                    "नेति नेति शब्द न ये अनुमाना\n" +
                    "सुरवर मुनिजन योगी समाधी न ये ध्याना ॥१॥\n" +
                    "\n" +
                    "सबाह्य अभ्यंतरी तू एक दत्त\n" +
                    "अभाग्यासी कैसी न कळे ही मात\n" +
                    "पराही परतली तेथे कैचा हा हेत\n" +
                    "जन्म मरणाचा पुरलासे अंत ॥२॥\n" +
                    "\n" +
                    "दत्त येऊनिया उभा ठाकला\n" +
                    "भावे साष्टांगेसी प्रणिपात केला\n" +
                    "प्रसन्न होउनी आशीर्वाद दिधला\n" +
                    "जन्ममरणाचा फेरा चुकविला ॥३॥\n" +
                    "\n" +
                    "दत्त दत्त ऐसे लागले ध्यान\n" +
                    "हरपले मन झाले उन्मन\n" +
                    "मी तू पणाची झाली बोळवण\n" +
                    "एका जनार्दनी श्रीदत्त ध्यान ॥४॥");
        }
        if(intValue ==12)
        {
            t2.setText("प्रार्थना");
            t1.setText("सदा सर्वदा योग तूझा घडावा |" +
                    "तुझे कारणी देह माझा पडावा |" +
                    "उपेक्षू नको गूणवंता अनंता |" +
                    "रघूनायका मागणे हेचि आतां  ||\n\n" +
                    "कैलास राणा शिव  चंद्रमौळी |" +
                    "फणींद्र माथा मुकुटी झळाळी ||" +
                    "कारुण्य सिंधू  भवदु:खहारी |" +
                    "तुजवीण शंभो मज  कोण तारी ||\n\n" +
                    "मोरया मोरया  मी बाळ तान्हें |" +
                    "तुझीच सेवा करु काय जाणे ||" +
                    "अन्याय माझे कोट्यानुकोटी |" +
                    "मोरेश्वरा ब तू घाल पोटी ||\n\n" +
                    "ज्या ज्या ठीकांणी मन जाय माझे  |" +
                    "त्या त्या  ठीकांणी निजरुप  तुझे ||" +
                    "मी ठेवितो मस्तक ज्या ठीकांणी |" +
                    "तेथे तुझे सदगुरु पाय दोन्ही ||" +
                    "अलंकापुरी पुण्य भूमी पवित्र |\n\n" +
                    "तिथे नांदतो ग्यानराजा सुपात्र |" +
                    "तया आठविता महापुण्यराशी|" +
                    "नमस्कार माझा सदगुरु गयानेश्वराशी ||");
        }

        if(intValue ==13)
        {
            t2.setText("पुष्पांजली");
            t1.setText("ॐ यज्ञेन यज्ञमयजंत देवास्तानि\n" +
                    "धर्माणि प्रथमान्यासन्|\n" +
                    "ते हं नाकं महिमान: सचंत\n" +
                    "यत्र पूर्वे साध्या: संति देवा:\n\n" +
                    "ॐ राजाधिराजाय प्रसह्ये साहिने|\n" +
                    "नमो वयं वैश्रवणाय कुर्महे\n" +
                    "स मे कामान्कामकामाय मह्यम्|\n" +
                    "कामेश्वरो वैश्रवणो ददातु|\n" +
                    "कुबेराय वैश्रवणाय |\n\n" +
                    "महाराजाय नम: ॐ स्वस्ति\n" +
                    "साम्राज्यं भौज्यं स्वाराज्यं वैराज्यं\n" +
                    "पारमेष्ठ्यं राज्यं\n" +
                    "माहाराज्यमाधिपत्यमयं समंतपर्यायी\n\n" +
                    "स्यात्सार्वभौम: सार्वायुष\n" +
                    "आंतादापरार्धात्पृथिव्यै\n" +
                    "समुद्रपर्यंता या एकराळिति\n" +
                    "तदप्येष श्लोकोऽभिगीतो मरुत:\n" +
                    "परिवेष्टारो मरुत्तस्यावसन्गृहे\n" +
                    "आविक्षितस्य कामप्रेर्विश्वेदेवा: सभासद इति\n" +
                    "\n");
        }
        else
        {

        }

    }
    public boolean onOptionsItemSelected(MenuItem item) {
        Intent intent = new Intent(written_hindi_detail_aarti.this,written_aarti_hindi.class);
        startActivity(intent);

        return super.onOptionsItemSelected(item);
    }

    public void onBackPressed()
    {
        Intent intent = new Intent(written_hindi_detail_aarti.this,written_aarti_hindi.class);
        startActivity(intent);
    }
    public void back(View view)
    {
        if(intValue==0)
        {
            a=13;
            Intent intent = new Intent(written_hindi_detail_aarti.this,written_hindi_detail_aarti.class);
            intent.putExtra("songindex",a);
            startActivity(intent);
        }
        else{
            int value = intValue;
            int second = value -1;
            Intent intent = new Intent(written_hindi_detail_aarti.this,written_hindi_detail_aarti.class);
            intent.putExtra("songindex",second);
            startActivity(intent);
        }

    }
    public void next(View view)
    {

        if(intValue==13)
        {
            a=0;
            Intent intent = new Intent(written_hindi_detail_aarti.this,written_hindi_detail_aarti.class);
            intent.putExtra("songindex",a);
            startActivity(intent);
        }
        else{
            int value = intValue;
            int second = value +1;
            Intent intent = new Intent(written_hindi_detail_aarti.this,written_hindi_detail_aarti.class);
            intent.putExtra("songindex",second);
            startActivity(intent);
        }


    }
}
